#Реализуйте алгоритм перемешивания списка. Встроенный алгоритм SHUFFLE не использовать! 
#Реализовать свой метод
list = [1,2,3,4,5,6,7,8,9,10]
print(list)
import random
print(random.sample(list,10))